; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v13 ?v7)
             (pred_7 ?v6 ?v4)
             (pred_9 ?v13 ?v4)
             (pred_11 ?v12 ?v13 )
	     (pred_10 ?v13)
             (pred_1 ?v9)
             (pred_4 ?v6)
             (pred_2 ?v4)
             (pred_8 ?v13)
             (pred_5 ?v6)
             (pred_6 ?v13)
             (pred_3 ))



(:action op_5
:parameters (?v5 ?v11 ?v2 ?v1)
:precondition (and (pred_1 ?v5) (pred_1 ?v11) (pred_4 ?v2) (pred_2 ?v1)
          (pred_12 ?v5 ?v11) (pred_7 ?v2 ?v1)
                   (pred_9 ?v11 ?v1) (pred_10 ?v5) 
                   (pred_8 ?v11) (pred_5 ?v2))
:effect (and  (pred_6 ?v11) (not (pred_8 ?v11))))


(:action op_2
:parameters (?v5 ?v10)
:precondition (and (pred_1 ?v5) (pred_1 ?v10)
               (pred_10 ?v5) (pred_12 ?v5 ?v10) (pred_6 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v5))))

(:action op_4
:parameters (?v5 ?v2)
:precondition (and (pred_1 ?v5) (pred_4 ?v2) 
                  (pred_10 ?v5) (pred_11 ?v2 ?v5) (pred_3 ))
:effect (and (pred_5 ?v2)
   (not (pred_11 ?v2 ?v5)) (not (pred_3 ))))


(:action op_1
:parameters (?v5 ?v8 ?v3)
:precondition (and (pred_1 ?v5) (pred_4 ?v8) (pred_4 ?v3)
                  (pred_10 ?v5) (pred_5 ?v3) (pred_11 ?v8 ?v5))
:effect (and (pred_5 ?v8) (pred_11 ?v3 ?v5)
        (not (pred_5 ?v3)) (not (pred_11 ?v8 ?v5))))

(:action op_3
:parameters (?v5 ?v2)
:precondition (and (pred_1 ?v5) (pred_4 ?v2) 
                  (pred_10 ?v5) (pred_5 ?v2))
:effect (and (pred_3 ) (pred_11 ?v2 ?v5) (not (pred_5 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_28 obj_29 obj_15 obj_08 obj_04 obj_13 obj_27 obj_14 obj_03 obj_31 obj_02 obj_16 obj_23 obj_24 obj_01 obj_12 obj_21 obj_22 obj_26 obj_20 obj_18 obj_19 obj_07 obj_25
    obj_17 obj_11 obj_09
    obj_06 obj_30 obj_05
    )

    (:init
       (pred_3)

       (pred_1 obj_10)
       (pred_1 obj_28)
       (pred_1 obj_29)
       (pred_1 obj_15)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_1 obj_13)
       (pred_1 obj_27)
       (pred_1 obj_14)
       (pred_1 obj_03)
       (pred_1 obj_31)
       (pred_1 obj_02)
       (pred_1 obj_16)
       (pred_1 obj_23)
       (pred_1 obj_24)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_21)
       (pred_1 obj_22)
       (pred_1 obj_26)
       (pred_1 obj_20)
       (pred_1 obj_18)
       (pred_1 obj_19)
       (pred_1 obj_07)
       (pred_1 obj_25)
       (pred_2 obj_17)
       (pred_2 obj_11)
       (pred_2 obj_09)
       (pred_4 obj_06)
       (pred_4 obj_30)
       (pred_4 obj_05)

       (pred_12 obj_10 obj_04)
       (pred_12 obj_10 obj_28)
       (pred_12 obj_28 obj_13)
       (pred_12 obj_28 obj_29)
       (pred_12 obj_28 obj_10)
       (pred_12 obj_29 obj_27)
       (pred_12 obj_29 obj_15)
       (pred_12 obj_29 obj_28)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_15 obj_08)
       (pred_12 obj_15 obj_29)
       (pred_12 obj_08 obj_03)
       (pred_12 obj_08 obj_15)
       (pred_12 obj_04 obj_31)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_13 obj_27)
       (pred_12 obj_13 obj_28)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_27 obj_16)
       (pred_12 obj_27 obj_14)
       (pred_12 obj_27 obj_29)
       (pred_12 obj_27 obj_13)
       (pred_12 obj_14 obj_23)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_14 obj_27)
       (pred_12 obj_03 obj_24)
       (pred_12 obj_03 obj_08)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_31 obj_01)
       (pred_12 obj_31 obj_02)
       (pred_12 obj_31 obj_04)
       (pred_12 obj_02 obj_12)
       (pred_12 obj_02 obj_16)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_02 obj_31)
       (pred_12 obj_16 obj_21)
       (pred_12 obj_16 obj_23)
       (pred_12 obj_16 obj_27)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_23 obj_22)
       (pred_12 obj_23 obj_24)
       (pred_12 obj_23 obj_14)
       (pred_12 obj_23 obj_16)
       (pred_12 obj_24 obj_26)
       (pred_12 obj_24 obj_03)
       (pred_12 obj_24 obj_23)
       (pred_12 obj_01 obj_20)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_31)
       (pred_12 obj_12 obj_18)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_21 obj_19)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_21 obj_16)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_22 obj_07)
       (pred_12 obj_22 obj_26)
       (pred_12 obj_22 obj_23)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_26 obj_25)
       (pred_12 obj_26 obj_24)
       (pred_12 obj_26 obj_22)
       (pred_12 obj_20 obj_18)
       (pred_12 obj_20 obj_01)
       (pred_12 obj_18 obj_19)
       (pred_12 obj_18 obj_12)
       (pred_12 obj_18 obj_20)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_19 obj_21)
       (pred_12 obj_19 obj_18)
       (pred_12 obj_07 obj_25)
       (pred_12 obj_07 obj_22)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_25 obj_26)
       (pred_12 obj_25 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_15)
       (pred_8 obj_23)
       (pred_9  obj_22 obj_17)
       (pred_9  obj_15 obj_11)
       (pred_9  obj_23 obj_09)
       (pred_6 obj_10)
       (pred_6 obj_28)
       (pred_6 obj_29)
       (pred_6 obj_08)
       (pred_6 obj_04)
       (pred_6 obj_13)
       (pred_6 obj_27)
       (pred_6 obj_14)
       (pred_6 obj_03)
       (pred_6 obj_31)
       (pred_6 obj_02)
       (pred_6 obj_16)
       (pred_6 obj_24)
       (pred_6 obj_01)
       (pred_6 obj_12)
       (pred_6 obj_21)
       (pred_6 obj_26)
       (pred_6 obj_20)
       (pred_6 obj_18)
       (pred_6 obj_19)
       (pred_6 obj_07)
       (pred_6 obj_25)

       (pred_7  obj_06 obj_17)
       (pred_7  obj_30 obj_11)
       (pred_7  obj_05 obj_09)
       (pred_11 obj_06 obj_16)
       (pred_11 obj_30 obj_19)
       (pred_11 obj_05 obj_31)
       (pred_10 obj_10)
    )

    (:goal (and
       (pred_11 obj_30 obj_04)
    ))
(:constraints
  (always (not (pred_10 obj_21)))
)
)

; plan
1. (op_2 obj_10 obj_28)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_28)
   goals met: 0 of 1
2. (op_2 obj_28 obj_13)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_13)
   goals met: 0 of 1
3. (op_2 obj_13 obj_02)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_02)
   goals met: 0 of 1
4. (op_2 obj_02 obj_12)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_12)
   goals met: 0 of 1
5. (op_2 obj_12 obj_18)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_18)
   goals met: 0 of 1
6. (op_2 obj_18 obj_19)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_19)
   goals met: 0 of 1
7. (op_4 obj_19 obj_30)
   deleted: (pred_11 obj_30 obj_19) (pred_3)
   added: (pred_5 obj_30)
   goals met: 0 of 1
8. (op_2 obj_19 obj_18)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_18)
   goals met: 0 of 1
9. (op_2 obj_18 obj_12)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_12)
   goals met: 0 of 1
10. (op_2 obj_12 obj_02)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_02)
   goals met: 0 of 1
11. (op_2 obj_02 obj_13)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_13)
   goals met: 0 of 1
12. (op_2 obj_13 obj_04)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_04)
   goals met: 0 of 1
13. (op_3 obj_04 obj_30)
   deleted: (pred_5 obj_30)
   added: (pred_3) (pred_11 obj_30 obj_04)
   goals met: 1 of 1
